app/controllers/admin/products_controller.rb

  def find_resource
    Product.find_by_permalink(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`permalink` = '100' LIMIT 1

  def load_data
    @tax_categories = TaxCategory.order(:name)
    @shipping_categories = ShippingCategory.order(:name)
---
SELECT `tax_categories`.* FROM `tax_categories` ORDER BY name
SELECT `shipping_categories`.* FROM `shipping_categories` ORDER BY name