app/controllers/products_controller.rb

SELECT COUNT(*) FROM `pages` WHERE (show_in_sidebar = 1)
SELECT COUNT(*) FROM `products` WHERE (products.deleted_at is NULL) AND (products.available_on <= '2012-08-06 09:27:46')
SELECT `pages`.* FROM `pages` WHERE (show_in_header = 1) ORDER BY position ASC
---
  def index
    products = Product.order('created_at').not_deleted.published
    # scopes
    if params[:scope]
      products = eval "products.#{params[:scope]}_products"
    end

    if params[:keywords]
      products = products.where('name LIKE ?', "%#{params[:keywords]}%")
    end

    # sorting and order
    if params[:sort]
      if params[:order] == 'DESC'
        products = products.sort_by! { |product| product.try(params[:sort]) }.reverse
      else
        products = products.sort_by! { |product| product.try(params[:sort]) }
      end
    else
      if params[:order] == 'DESC'
        products = products.sort_by! { |product| product.created_at }.reverse
      else
        products = products.sort_by! { |product| product.created_at }
      end
    end

    @products = products.paginate(:page => params[:page], :per_page => 8)